app/controllers/control_registry_controller.rb

  def request_post
	name = Rails.root.to_s.scan(/\w+$/).first
	if params[:service_provider] == name
		post = Post.find_by_name(params[:name])
---
SELECT "posts".* FROM "posts" WHERE "posts"."name" = 'Prva' LIMIT 1