app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content_content_type", "content_file_name", "content_file_size", "content_updated_at", "created_at", "description", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)